run/tutorial1/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 373;

boundaryField
{
    topAndBottom
    {
        type            zeroGradient;
    }

    left
    {
        type            chtRcTemperature;
        radiation       off;
        K               k;
        remoteField     T;
        value           uniform 373;
    }

    right
    {
        type            fixedValue;
        value           uniform 473;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
